In [1]:
import pandas as pd

In [2]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("Restaurant - Customers.csv")
foods = pd.read_csv("Restaurant - Foods.csv")

# pd.concat() Method

In [3]:
len(week1)

250

In [4]:
len(week2)

250

In [5]:
pd.concat([week1, week2]).tail()

     Customer ID  Food ID
245          783       10
246          556       10
247          547        9
248          252        9
249          249        6

In [6]:
pd.concat([week1, week2], ignore_index=True).tail()

     Customer ID  Food ID
495          783       10
496          556       10
497          547        9
498          252        9
499          249        6

In [7]:
pd.concat([week1, week2], keys=["Week 1", "Week 2"]).tail()

            Customer ID  Food ID
Week 2 245          783       10
       246          556       10
       247          547        9
       248          252        9
       249          249        6

In [8]:
sales = pd.concat([week1, week2], keys=["A", "B"])

In [9]:
sales.loc["B"].loc[5]

Customer ID    310
Food ID          5
Name: 5, dtype: int64

In [10]:
sales.loc[("B", 5)]

Customer ID    310
Food ID          5
Name: (B, 5), dtype: int64

In [11]:
sales.loc[("B", 5), "Customer ID"]

310

# The .append() Method

In [12]:
week1.append(week2).head(2)

   Customer ID  Food ID
0          537        9
1           97        4

In [13]:
week1.head(2)

   Customer ID  Food ID
0          537        9
1           97        4

In [14]:
week2.tail(2)

     Customer ID  Food ID
248          252        9
249          249        6

In [15]:
week1.append(week2).tail(2)

     Customer ID  Food ID
248          252        9
249          249        6

# Inner Joins

In [16]:
week1.merge(week2, how='inner', on="Customer ID").head(4)

   Customer ID  Food ID_x  Food ID_y
0          537          9          5
1          155          9          3
2          155          1          3
3          503          5          8

In [17]:
week1.merge(week2, how='inner', on="Customer ID", 
            suffixes=('_1', '_2')).head(4)

   Customer ID  Food ID_1  Food ID_2
0          537          9          5
1          155          9          3
2          155          1          3
3          503          5          8

In [18]:
week1[week1["Customer ID"] == 155]

    Customer ID  Food ID
4           155        9
17          155        1

In [19]:
week2[week2["Customer ID"] == 155]

     Customer ID  Food ID
208          155        3

In [20]:
week1.merge(week2, how='inner', on=["Customer ID", "Food ID"])

   Customer ID  Food ID
0          304        3
1          540        3
2          937       10
3          233        3
4           21        4
5           21        4
6          922        1
7          578        5
8          578        5

In [21]:
week1[week1["Customer ID"] == 21]

     Customer ID  Food ID
101           21        4
212           21        4

In [22]:
week2[week2["Customer ID"] == 21]

    Customer ID  Food ID
30           21        4

# Outer Joins

In [23]:
week1.head(2)

   Customer ID  Food ID
0          537        9
1           97        4

In [24]:
week2.head(2)

   Customer ID  Food ID
0          688       10
1          813        7

In [25]:
merged = week1.merge(week2, how="outer", on="Customer ID", 
            suffixes=[" - Week 1", " - Week 2"], indicator=True)

In [26]:
merged["_merge"].value_counts()

right_only    197
left_only     195
both           62
Name: _merge, dtype: int64

In [27]:
merged[merged["_merge"] != "both"].head()

   Customer ID  Food ID - Week 1  Food ID - Week 2     _merge
1           97               4.0               NaN  left_only
2          658               1.0               NaN  left_only
3          202               2.0               NaN  left_only
6          213               8.0               NaN  left_only
7          600               1.0               NaN  left_only

# Left Join

In [28]:
week1.head(3)

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1

In [29]:
foods.head(3)

   Food ID Food Item  Price
0        1     Sushi   3.99
1        2   Burrito   9.99
2        3      Taco   2.99

In [30]:
week1.merge(foods, how="left", on="Food ID").head(3)

   Customer ID  Food ID   Food Item  Price
0          537        9       Donut   0.99
1           97        4  Quesadilla   4.25
2          658        1       Sushi   3.99

In [31]:
week1.merge(foods, how="left", on="Food ID", sort=True).head(3)

   Customer ID  Food ID Food Item  Price
0          658        1     Sushi   3.99
1          600        1     Sushi   3.99
2          155        1     Sushi   3.99

# The left_on and right_on Params

In [32]:
week2.head(3)

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10

In [33]:
customers.head(3)

   ID First Name Last Name  Gender  Company                     Occupation
0   1     Joseph   Perkins    Male  Dynazzy  Community Outreach Specialist
1   2   Jennifer   Alvarez  Female     DabZ        Senior Quality Engineer
2   3      Roger     Black    Male  Tagfeed              Account Executive

In [35]:
week2.merge(customers, how="left", left_on="Customer ID", 
            right_on="ID").drop("ID", axis=1).head(3)

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation
0,688,10,Carl,Williamson,Male,Thoughtmix,Graphic Designer
1,813,7,Johnny,Walker,Male,Kayveo,Developer II
2,495,10,Deborah,Little,Female,Babbleblab,VP Accounting

# Merging the Indexes with left_index and right_index Parameters

In [36]:
customers.head(3)

   ID First Name Last Name  Gender  Company                     Occupation
0   1     Joseph   Perkins    Male  Dynazzy  Community Outreach Specialist
1   2   Jennifer   Alvarez  Female     DabZ        Senior Quality Engineer
2   3      Roger     Black    Male  Tagfeed              Account Executive

In [38]:
customers.set_index("ID", inplace=True)
foods.set_index("Food ID", inplace=True)

In [40]:
customers.head(3)

   First Name Last Name  Gender  Company                     Occupation
ID
1      Joseph   Perkins    Male  Dynazzy  Community Outreach Specialist
2    Jennifer   Alvarez  Female     DabZ        Senior Quality Engineer
3       Roger     Black    Male  Tagfeed              Account Executive

In [41]:
foods.head(3)

        Food Item  Price
Food ID
1           Sushi   3.99
2         Burrito   9.99
3            Taco   2.99

In [43]:
week1.merge(customers, how="left", left_on="Customer ID", 
            right_index=True).head(3)

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation
0,537,9,Cheryl,Carroll,Female,Zoombeat,Registered Nurse
1,97,4,Amanda,Watkins,Female,Ozu,Account Coordinator
2,658,1,Patrick,Webb,Male,Browsebug,Community Outreach Specialist

In [44]:
week1.merge(foods, how="left", left_on="Food ID", 
            right_index=True).head(3)

   Customer ID  Food ID   Food Item  Price
0          537        9       Donut   0.99
1           97        4  Quesadilla   4.25
2          658        1       Sushi   3.99

In [45]:
w1_merged = week1.merge(customers, how="left", left_on="Customer ID", 
                        right_index=True)
w1_merged = w1_merged.merge(foods, how="left", left_on="Food ID", 
                            right_index=True)

In [46]:
w1_merged.head(2)

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation,Food Item,Price
0,537,9,Cheryl,Carroll,Female,Zoombeat,Registered Nurse,Donut,0.99
1,97,4,Amanda,Watkins,Female,Ozu,Account Coordinator,Quesadilla,4.25

In [47]:
week1.head(2)

   Customer ID  Food ID
0          537        9
1           97        4

In [48]:
week2.head(2)

   Customer ID  Food ID
0          688       10
1          813        7

In [49]:
week1.merge(week2, left_index=True, right_index=True).head(3)

   Customer ID_x  Food ID_x  Customer ID_y  Food ID_y
0            537          9            688         10
1             97          4            813          7
2            658          1            495         10

# The .join() Method

In [50]:
satisfaction = pd.read_csv("Restaurant - Week 1 Satisfaction.csv")

In [51]:
week1.head(2)

   Customer ID  Food ID
0          537        9
1           97        4

In [52]:
satisfaction.head(2)

   Satisfaction Rating
0                    2
1                    7

In [53]:
week1.join(satisfaction).head(3)

   Customer ID  Food ID  Satisfaction Rating
0          537        9                    2
1           97        4                    7
2          658        1                    3

# The pd.merge() Method

In [55]:
pd.merge(week1, customers, how='left', left_on="Customer ID", 
         right_index=True).head(3)

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation
0,537,9,Cheryl,Carroll,Female,Zoombeat,Registered Nurse
1,97,4,Amanda,Watkins,Female,Ozu,Account Coordinator
2,658,1,Patrick,Webb,Male,Browsebug,Community Outreach Specialist